"a. Создать список, состоящий из кубов нечётных чисел от 1 до 1000 (куб X - третья степень числа X).Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7."

my_list_of_odd_cubes = [variable ** 3 for variable in range(1, 1000, 2) if ((variable ** 3 // 100000000 + ((variable ** 3 % 100000000) // 10000000) + (((variable ** 3 % 100000000) % 10000000) // 1000000) +
     ((((variable ** 3 % 100000000) % 10000000) % 1000000) // 100000) + (((((variable ** 3 % 100000000) % 10000000) % 1000000) % 100000) // 10000) +
     ((((((variable ** 3 % 100000000) % 10000000) % 1000000) % 100000) % 10000) // 1000)+(((((((variable ** 3 % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) // 100)
     + ((((((((variable ** 3 % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) % 100) // 10) + (variable ** 3 % 10)) % 7 == 0)]
print (sum(my_list_of_odd_cubes))

" b. К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7."

my_list_of_odd_cubes_new = [((variable ** 3) + 17) for variable in range(1, 1000, 2) if ((((variable ** 3) + 17) // 100000000 + ((((variable ** 3) + 17) % 100000000) // 10000000) + (((((variable ** 3) + 17) % 100000000) % 10000000) // 1000000) +
     ((((((variable ** 3) + 17) % 100000000) % 10000000) % 1000000) // 100000) + (((((((variable ** 3) + 17) % 100000000) % 10000000) % 1000000) % 100000) // 10000) +
     ((((((((variable ** 3) + 17) % 100000000) % 10000000) % 1000000) % 100000) % 10000) // 1000)+(((((((((variable ** 3) + 17) % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) // 100)
     + ((((((((((variable ** 3) + 17) % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) % 100) // 10) + (((variable ** 3) + 17) % 10)) % 7 == 0)]
print (sum(my_list_of_odd_cubes_new))
